backEnd/api/test/v3-stress.yml
config:
  target: "http://localhost:4000/run"
  socketio:
    transports: ["websocket"]
  phases:
    - name: ramp-up
      duration: 120
      arrivalRate: 10
      rampTo : 300
  plugins:
    ensure: { }
  ensure:
    maxErrorRate: 1
    thresholds:
      - "vusers.session_length.p99": 6000
      - "socketio.response_time.p99" : 6000
    condition:
      - strict: true
scenarios:
  - name: Run Code V3
    engine: socketio
    flow:
      - think: 1
      - emit:
          channel: "request"
          data:
            code: "print('Hello World')"
            language: "python"
        response:
          on: 'done'
          data : [201]
      - think: 2